Config/InformationRegisters/НастройкаОрганизацийДляГИСГМП_УНП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>НастройкаОрганизацийДляГИСГМП_УНП</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВидОбмена</Name>
					<Comment>Используемый вид обмена, для обмена с ГИС ГМП (ИС УНП)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыОбменаБанкиКС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВерсияФорматов</Name>
					<Comment>1.15 или 1.16</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УРН</Name>
					<Comment>Уникальный регистрационный код участника в ГИС ГМП</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РежимВзаимодействия</Name>
					<Comment>"Косвенное" или "Прямое"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РежимПодписи</Name>
					<Comment>"ПриОбмене" или "Самостоятельно"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РазмерПакетаНачислений</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПолномочияУчастника</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СертификатЭПНачислений</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СертификатыКлючейЭлектроннойПодписиИШифрования</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СертификатЭПСообщения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СертификатыКлючейЭлектроннойПодписиИШифрования</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИмяИСУчастника</Name>
					<Comment>Имя ИС (с которым выполнена регистрация ИС в СМЭВ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодИСУчастника</Name>
					<Comment>Мнемоника ИС (выдается при регистрации ИС в СМЭВ)(6 знаков)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипВзаимодействия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АдресTSA</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодУчастника</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ХранитьПарольЭПНачисления</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ХранитьПарольЭПСообщения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НастройкаОбмена</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкиОбменаБанкиКС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НастройкаФорматов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкаФорматовОбменаБанкиКС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УРНГАН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПолномочияУчастникаГАН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПолномочияУчастникаАЗ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПолномочияУчастникаГАЗ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодМаршрутизации</Name>
					<Comment>Код маршрутизации вида сведений, указывается в личном кабинете участника взаимодействия при подключении вида сведений</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторНоды</Name>
					<Comment>NodeID - идентификатор ноды, используется только в обмене с ИС РНИП</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЭтоУчастникПосредник</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПолномочияУчастникаПосредникаНСИ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПолномочияУчастникаПосредникаНачисления</Name>
					<Comment>В ГИС ГМП - 17 или 18, в ИС РНИП - 13</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подведомственный</Name>
					<Comment>Если подведомственный не указан, то это собственные настройки организации, если указан, то настройки подведомственного</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Config/InformationRegisters/НастройкаОрганизацийДляГИСГМП_УНП/Forms/ФормаНастройки/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбменСГИСГМП = ПолучитьФункциональнуюОпцию("ИспользоватьИнтеграциюГИСГМП");
	Если ОбменСГИСГМП Тогда
	    Элементы.ДеревоНастроек.Подсказка = "Список содержит перечень всех организаций и контрагентов с признаком ""Администратор начислений"", которые могут быть участниками.";
	КонецЕсли;
	
	ЕстьАЗ = ПолучитьФункциональнуюОпцию("ИспользоватьОбменСГИСГМП_АЗ");
	
	Элементы.ТекущаяЗаписьПолномочияУчастникаАЗ.Видимость = ЕстьАЗ;
	Элементы.ТекущаяЗаписьПолномочияУчастникаГАЗ.Видимость = ЕстьАЗ;
	
	Элементы.ТекущиеНастройкиВыбранногоУчастника.Доступность = ЗначениеЗаполнено(ОрганизацияКонтрагент);
	Элементы.ДеревоНастроекПредставлениеОрганизации.Заголовок = Элементы.ДеревоНастроекПредставлениеОрганизации.Заголовок 
									+ ?(ОбменСГИСГМП,"/Подведомственные","");

	Элементы.ГруппаКосвенноеВзаимодействие.Видимость = ОбменСГИСГМП;
	Элементы.ГруппаНастройкиУчастникаПрямогоВзаимодействия.Видимость = ОбменСГИСГМП;
	
	ОрганизацияВОтборе = Неопределено;
	Если Параметры.Свойство("Отбор") Тогда
		Параметры.Отбор.Свойство("Организация",ОрганизацияВОтборе);		
	КонецЕсли;
	
	Элементы.ТекущаяЗаписьКодУчастника.Видимость = ПолучитьФункциональнуюОпцию("ИспользоватьИнтеграциюСУНИФО");
		
	ШаблонУИН = "";
	ШаблонУИН = Справочники.ШаблоныИдентификаторовКвитанцийНаОплатуГосуслуг.ПолучитьШаблонУИНКвитанции(ОрганизацияВОтборе);
		
	ОбновитьДеревоСтруктурыПодведомственных(Ложь,ОрганизацияВОтборе);
	ОпределитьВидимостьПолейНастроек();
	
	ЗаполнитьРазрешенныеОрганизации();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если ЕстьОшибка Тогда
		ТекстОшибки = НСтр("ru='Внимание!
		|В списке участников присутствуют организации, указанные как ГАН для других участников,
		|но для них самих в настройке выбран другой участник-ГАН.
		|Организации, передающие данные подведомственных в сервис, не могут сами считаться подведомственными.	
		|Необходимо исправить настройки таких организаций (выделены красным)!'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
	КонецЕсли;
	Если ЗначениеЗаполнено(ОрганизацияКонтрагент) Тогда
		ПриИзмененииУчастника();
		ПриИзмененииРежимаВзаимодействия();
		Элементы.ТекущиеНастройкиВыбранногоУчастника.Доступность = ЗначениеЗаполнено(ОрганизацияКонтрагент);
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если ЗавершениеРаботы И Модифицированность Тогда
		ТекстПредупреждения = ОбщегоНазначенияБГУКлиент.СтандартныйТекстПредупрежденияПриЗавершенииРаботы();
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если Модифицированность Тогда	
		
		Отказ = Истина;
		
		ПоказатьВопрос(Новый ОписаниеОповещения("ПередЗакрытиемЗавершение", ЭтотОбъект), Нстр("ru='При закрытии формы изменения будут потеряны. Закрыть форму?'"), РежимДиалогаВопрос.ДаНет);

	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытиемЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда 
		
		Модифицированность = Ложь;
		
		Закрыть();
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТекущаяЗаписьРежимВзаимодействияПриИзменении(Элемент)
	ПриИзмененииРежимаВзаимодействия();		
КонецПроцедуры

&НаКлиенте
Процедура ГАНВДругойБазеПриИзменении(Элемент)
	
	Если ГАНВДругойБазе Тогда
		ОрганизацияГАН = ""; 
	КонецЕсли;
	
	Элементы.ТекущаяЗаписьУРНГАН.АвтоОтметкаНезаполненного = ГАНВДругойБазе;
	Элементы.ТекущаяЗаписьПолномочияУчастникаГАНа.АвтоОтметкаНезаполненного = ГАНВДругойБазе;
	
	Элементы.ОрганизацияГАН.Доступность = НЕ ГАНВДругойБазе;
КонецПроцедуры

&НаКлиенте
Процедура ТекущаяЗаписьВерсияФорматовПриИзменении(Элемент)
	ОпределитьВидимостьПолейНастроек();
КонецПроцедуры

&НаКлиенте
Процедура ТекущаяЗаписьЭтоУчастникПосредникПриИзменении(Элемент)
	Если ТекущаяЗапись.ЭтоУчастникПосредник Тогда
		Если ЭтоОбменИСРНИП(ТекущаяЗапись.ВидОбмена) Тогда
			//в обмене с ИС РНИП используется свое значение полномочий для посредника - 13
			//в гис гмп для разных видов сведений - разные значения =(
			ТекущаяЗапись.ПолномочияУчастникаПосредникаНСИ = "13";
			ТекущаяЗапись.ПолномочияУчастникаПосредникаНачисления = "13";
		КонецЕсли;
	Иначе
		ТекущаяЗапись.ПолномочияУчастникаПосредникаНСИ = "";
		ТекущаяЗапись.ПолномочияУчастникаПосредникаНачисления = "";
	КонецЕсли;
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,"ТекущаяЗаписьПолномочияУчастникаПосредника","ТолькоПросмотр",НЕ ТекущаяЗапись.ЭтоУчастникПосредник);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,"ТекущаяЗаписьПолномочияУчастникаПосредникаНачисления","ТолькоПросмотр",НЕ ТекущаяЗапись.ЭтоУчастникПосредник);
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЭтоОбменИСРНИП(ВидОбмена)
	
	ОбменРНИП_УНП = ПолучитьФункциональнуюОпцию("ИспользоватьИнтеграциюСУНИФО");
	
	Если ПолучитьКодВидаОбмена(ВидОбмена) = "G2"
		И ОбменРНИП_УНП Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьКодВидаОбмена(ВидОбмена)
	
	Если НЕ ЗначениеЗаполнено(ВидОбмена) Тогда
		Возврат "";
	КонецЕсли;
	
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВидОбмена,"ПредставлениеВНомереВерсии");
	
КонецФункции

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Обновить(Команда)
	ОчиститьСообщения();
	ОбновитьДеревоСтруктурыПодведомственных(Истина);
КонецПроцедуры

&НаКлиенте
Процедура Записать(Команда)
	Если НЕ ЗначениеЗаполнено(ОрганизацияКонтрагент) Тогда
		ТекстСообщения = Нстр("ru='Не выбран участник, настройки которого требуется записать.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат;	
	КонецЕсли;
	//Тут нужно добавить проверку на заполнение обязательных полей
	
	//
	Если ТекущаяЗапись.РежимВзаимодействия = "Косвенное" Тогда
		Если ЗначениеЗаполнено(ОрганизацияГАН) Тогда
			ТекущаяЗапись.Организация = ОрганизацияГАН;
			ТекущаяЗапись.Подведомственный = ОрганизацияКонтрагент;
		Иначе
			//Организация ГАН находится в другой базе
			ТекущаяЗапись.Организация = ОрганизацияКонтрагент;
			ТекущаяЗапись.Подведомственный = Неопределено;
		КонецЕсли;
	ИначеЕсли ТекущаяЗапись.РежимВзаимодействия = "Прямое" Тогда
		ТекущаяЗапись.Организация = ОрганизацияКонтрагент;
		ТекущаяЗапись.Подведомственный = Неопределено;
	КонецЕсли;
	ОчиститьСообщения();
	ЗаписатьНастройку();
	
	Оповестить("ОбновлениеНастройкиУчастников",ОрганизацияКонтрагент,ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура Выбрать(Команда)
	
	ТекДанные = Элементы.ДеревоНастроек.ТекущиеДанные;
	Если ТекДанные<>Неопределено Тогда
		
		Если НЕ ЗначениеЗаполнено(ТекДанные.Организация) И НЕ ЗначениеЗаполнено(ТекДанные.Подведомственный) Тогда
			Возврат;
		КонецЕсли;
		
		Если Модифицированность Тогда 
			Текст = Нстр("ru='При выборе настройки другого участника не записанные изменения будут потеряны.
			| Продолжить?'");

			ПоказатьВопрос(Новый ОписаниеОповещения("ВыбратьЗавершение", ЭтотОбъект, Новый Структура("ТекДанные", ТекДанные)), Текст,РежимДиалогаВопрос.ДаНет,,КодВозвратаДиалога.Нет,"Выбор участника");
            Возврат;
		КонецЕсли;
		
		ВыбратьДействие(ТекДанные);

	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПроверитьВозможностьРедактированияСтроки(ТекДанные)
	
	ОрганизацияНастроек = Неопределено;
	Если ЗначениеЗаполнено(ТекДанные.Подведомственный)
		И ТипЗнч(ТекДанные.Подведомственный) = Тип("СправочникСсылка.Организации") Тогда
		ОрганизацияНастроек = ТекДанные.Подведомственный;
	Иначе
		ОрганизацияНастроек = ТекДанные.Организация;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ОрганизацияНастроек) Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если РазрещенныеОрганизации.Получить(ОрганизацияНастроек) <> Истина Тогда
		ТекстСообщения = НСтр("ru='Нет прав на редактирование настроек по организации %1.'");
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения,ТекДанные.ПредставлениеОрганизации);
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат Ложь;//редактирование настроек по данной организации запрещено
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Процедура ВыбратьЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	ТекДанные = ДополнительныеПараметры.ТекДанные;
	
	Если Результат <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ВыбратьДействие(ТекДанные);

КонецПроцедуры

&НаКлиенте
Процедура ВыбратьДействие(Знач ТекДанные)
	
	Перем ИдентификаторСтр;
	
	ОчиститьСообщения();
	
	Если ПроверитьВозможностьРедактированияСтроки(ТекДанные) = Ложь Тогда
		Возврат;
	КонецЕсли;
		
	ИдентификаторСтр = ТекДанные.ПолучитьИдентификатор();
	ВыбратьНаСервере(ИдентификаторСтр);
	
	ПриИзмененииУчастника();
	ПриИзмененииРежимаВзаимодействия();
	Элементы.ТекущиеНастройкиВыбранногоУчастника.Доступность = ЗначениеЗаполнено(ОрганизацияКонтрагент);

КонецПроцедуры

&НаКлиенте
Процедура УдалитьЗапись(Команда)
	
	ТекДанные = Элементы.ДеревоНастроек.ТекущиеДанные;
	
	Если ТекДанные<>Неопределено Тогда
		
		Если НЕ ТекДанные.ЕстьНастройка Тогда
			Возврат;
		КонецЕсли;
		
		Если ПроверитьВозможностьРедактированияСтроки(ТекДанные) = Ложь Тогда
			Возврат;
		КонецЕсли;
		
		Текст = Нстр("ru='Удалить выделенную настройку?'");

		ПоказатьВопрос(Новый ОписаниеОповещения("УдалитьЗаписьЗавершение", ЭтотОбъект, Новый Структура("ТекДанные", ТекДанные)), Текст,РежимДиалогаВопрос.ОКОтмена,,КодВозвратаДиалога.Отмена,"Удаление настройки");
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьЗаписьЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	ТекДанные = ДополнительныеПараметры.ТекДанные;
	
	Если Результат = КодВозвратаДиалога.ОК Тогда
		ОчиститьСообщения();
		ИдентификаторСтр = ТекДанные.ПолучитьИдентификатор();		
		УдалитьЗаписьНаСервере(ИдентификаторСтр);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьРазрешенныеОрганизации()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Организации.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Организации КАК Организации";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	СоответствиеОрг = Новый Соответствие;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СоответствиеОрг.Вставить(ВыборкаДетальныеЗаписи.Ссылка,Истина);
	КонецЦикла;
	
	РазрещенныеОрганизации = Новый ФиксированноеСоответствие(СоответствиеОрг);
	
КонецПроцедуры

&НаСервере
Процедура ОпределитьВидимостьПолейНастроек()
	Если ТекущаяЗапись.ВерсияФорматов = "2.00"
		ИЛИ НЕ ЗначениеЗаполнено(ТекущаяЗапись.ВерсияФорматов) Тогда
		Элементы.ГруппаНастройкаОбмена.Видимость = Истина;		
		Элементы.ГруппаНастройкиУчастникаПрямогоВзаимодействия.Видимость = ОбменСГИСГМП;
		
		Элементы.ДанныеИСУчастника.Видимость = Ложь;
		Элементы.ТекущаяЗаписьТипВзаимодействия.Видимость = Ложь;
		Элементы.ТекущаяЗаписьАдресTSA.Видимость = Ложь;
		Элементы.ТекущаяЗаписьРежимПодписи.Видимость = Ложь;
		
	Иначе
		Элементы.ГруппаНастройкаОбмена.Видимость = Ложь;		
		Элементы.ГруппаНастройкиУчастникаПрямогоВзаимодействия.Видимость = Ложь;
		
		Элементы.ДанныеИСУчастника.Видимость = Истина;
		Элементы.ТекущаяЗаписьТипВзаимодействия.Видимость = Истина;
		Элементы.ТекущаяЗаписьАдресTSA.Видимость = Истина;
		Элементы.ТекущаяЗаписьРежимПодписи.Видимость = Истина;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНастройку()
	Запись = РеквизитФормыВЗначение("ТекущаяЗапись");
	Запись.Записать(Истина);
	
	УдаляемыеКлючи = Новый Массив;
	Если Запись.ХранитьПарольЭПНачисления = Ложь Тогда
		УдаляемыеКлючи.Добавить("ПарольЭПНачислений");
		ПарольЭПНачислений = "";
	КонецЕсли;
	Если Запись.ХранитьПарольЭПСообщения = Ложь Тогда
		УдаляемыеКлючи.Добавить("ПарольЭПСообщения");
		ПарольЭПСообщения = "";
	КонецЕсли;
	Если УдаляемыеКлючи.Количество()>0 Тогда
		КлючиСтрокой = СтрСоединить(УдаляемыеКлючи,",");
		УстановитьПривилегированныйРежим(Истина);
		ОбщегоНазначения.УдалитьДанныеИзБезопасногоХранилища(ОрганизацияКонтрагент,КлючиСтрокой);
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	Если ПарольЭПНачисленийИзменен 
		И Запись.ХранитьПарольЭПНачисления Тогда		
		ОбщегоНазначения.ЗаписатьДанныеВБезопасноеХранилище(ОрганизацияКонтрагент, ПарольЭПНачислений,"ПарольЭПНачислений");
		ПарольЭПНачислений = ОрганизацияКонтрагент.УникальныйИдентификатор();
	КонецЕсли;
	Если ПарольЭПСообщенияИзменен 
		И Запись.ХранитьПарольЭПСообщения Тогда		
		ОбщегоНазначения.ЗаписатьДанныеВБезопасноеХранилище(ОрганизацияКонтрагент, ПарольЭПСообщения,"ПарольЭПСообщения");
		ПарольЭПСообщения = ОрганизацияКонтрагент.УникальныйИдентификатор();
	КонецЕсли;
	УстановитьПривилегированныйРежим(Ложь);
		
	ПарольЭПНачисленийИзменен = Ложь;
	ПарольЭПСообщенияИзменен = Ложь;
	
	
	ОбновитьДеревоСтруктурыПодведомственных(Истина);
	ЭтаФорма.Модифицированность = Ложь;
	
	ОбновитьПовторноИспользуемыеЗначения();
КонецПроцедуры

&НаСервере
Процедура ОбновитьДеревоСтруктурыПодведомственных(СообщатьОбОшибке,УчастникПоУмолчанию = Неопределено)
	УстановитьПривилегированныйРежим(Истина);
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ОбменСГИСГМП",ОбменСГИСГМП);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НастройкаОрганизацийДляГИСГМП_УНП.Организация,
		|	НастройкаОрганизацийДляГИСГМП_УНП.Подведомственный,
		|	НастройкаОрганизацийДляГИСГМП_УНП.ВидОбмена,
		|	НастройкаОрганизацийДляГИСГМП_УНП.ВерсияФорматов,
		|	ИСТИНА КАК ЕстьНастройка
		|ПОМЕСТИТЬ ДанныеРегистра
		|ИЗ
		|	РегистрСведений.НастройкаОрганизацийДляГИСГМП_УНП КАК НастройкаОрганизацийДляГИСГМП_УНП
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПредварительныеДанныеРегистра.Организация,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА ДляПроверки.Подведомственный ЕСТЬ NULL 
		|				ТОГДА ЛОЖЬ
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ) КАК ЕстьОшибка
		|ПОМЕСТИТЬ ОрганизацииСОшибкой
		|ИЗ
		|	ДанныеРегистра КАК ПредварительныеДанныеРегистра
		|		ЛЕВОЕ СОЕДИНЕНИЕ ДанныеРегистра КАК ДляПроверки
		|		ПО ПредварительныеДанныеРегистра.Организация = ДляПроверки.Подведомственный
		|
		|СГРУППИРОВАТЬ ПО
		|	ПредварительныеДанныеРегистра.Организация
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	NULL КАК Подведомственный,
		|	Организации.Ссылка КАК Организация
		|ПОМЕСТИТЬ СписокОрганизаций
		|ИЗ
		|	Справочник.Организации КАК Организации
		|		ЛЕВОЕ СОЕДИНЕНИЕ ДанныеРегистра КАК ДанныеРегистра
		|		ПО (ДанныеРегистра.Организация = Организации.Ссылка
		|				ИЛИ ДанныеРегистра.Подведомственный = Организации.Ссылка)
		|ГДЕ
		|	ДанныеРегистра.Организация ЕСТЬ NULL 
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Контрагенты.Ссылка,
		|	NULL
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|		ЛЕВОЕ СОЕДИНЕНИЕ ДанныеРегистра КАК ДанныеРегистра
		|		ПО (ДанныеРегистра.Подведомственный = Контрагенты.Ссылка)
		|ГДЕ
		|	ДанныеРегистра.Организация ЕСТЬ NULL 
		|	И Контрагенты.АдминистраторНачислений
		|	И &ОбменСГИСГМП = ИСТИНА
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДанныеРегистра.Подведомственный КАК Подведомственный,
		|	ДанныеРегистра.Организация КАК Организация,
		|	ДанныеРегистра.ВидОбмена КАК ВидОбмена,
		|	ДанныеРегистра.ВерсияФорматов КАК ВерсияФорматов,
		|	ДанныеРегистра.ЕстьНастройка,
		|	ЕСТЬNULL(ОрганизацииСОшибкой.ЕстьОшибка, ЛОЖЬ) КАК ЕстьОшибка
		|ИЗ
		|	ДанныеРегистра КАК ДанныеРегистра
		|		ЛЕВОЕ СОЕДИНЕНИЕ ОрганизацииСОшибкой КАК ОрганизацииСОшибкой
		|		ПО ДанныеРегистра.Подведомственный = ОрганизацииСОшибкой.Организация
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СписокОрганизаций.Подведомственный,
		|	ЕСТЬNULL(СписокОрганизаций.Организация, ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)),
		|	NULL,
		|	NULL,
		|	ЛОЖЬ,
		|	ЛОЖЬ
		|ИЗ
		|	СписокОрганизаций КАК СписокОрганизаций
		|
		|ИТОГИ ПО
		|	Организация";
	
	РезультатЗапроса = Запрос.Выполнить();
	ДеревоНастроек.ПолучитьЭлементы().Очистить();
	
	ВыборкаОрганизации = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ЕстьОшибка = Ложь;
	СтруктураУчастника = Новый Структура("Организация,Подведомственный");
	УчастникНайден = 0; // 0 - не найден, 1 - найден в организациях, 2 - найден в подведомственных
	Пока ВыборкаОрганизации.Следующий() Цикл
		НовыйЭлементОрг = ДеревоНастроек.ПолучитьЭлементы().Добавить();
		ЗаполнитьЗначенияСвойств(НовыйЭлементОрг,ВыборкаОрганизации);
		НовыйЭлементОрг.ПредставлениеОрганизации = НовыйЭлементОрг.Организация;
		Если НЕ ЗначениеЗаполнено(НовыйЭлементОрг.Организация) Тогда
			НовыйЭлементОрг.ПредставлениеОрганизации = "Список контрагентов-АН";
		КонецЕсли;
		ВыборкаДетальныеЗаписи = ВыборкаОрганизации.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Если НЕ ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Подведомственный) Тогда
				ЗаполнитьЗначенияСвойств(НовыйЭлементОрг,ВыборкаДетальныеЗаписи,"ЕстьНастройка,ВидОбмена,ВерсияФорматов,ЕстьОшибка");
				ЕстьОшибка = ЕстьОшибка ИЛИ НовыйЭлементОрг.ЕстьОшибка;
				Продолжить;
			КонецЕсли;
			
			НовыйЭлементПодвед = НовыйЭлементОрг.ПолучитьЭлементы().Добавить();
			ЗаполнитьЗначенияСвойств(НовыйЭлементПодвед,ВыборкаДетальныеЗаписи);
			НовыйЭлементПодвед.ПредставлениеОрганизации = НовыйЭлементПодвед.Подведомственный;
			Если УчастникНайден<2 И ЗначениеЗаполнено(УчастникПоУмолчанию) И УчастникПоУмолчанию = НовыйЭлементПодвед.Подведомственный Тогда
				ЗаполнитьЗначенияСвойств(СтруктураУчастника,НовыйЭлементПодвед);
				УчастникНайден = 2;
			КонецЕсли;
			ЕстьОшибка = ЕстьОшибка ИЛИ НовыйЭлементПодвед.ЕстьОшибка;
		КонецЦикла;
		Если УчастникНайден<1 И ЗначениеЗаполнено(УчастникПоУмолчанию) И УчастникПоУмолчанию = НовыйЭлементОрг.Организация Тогда
			 ЗаполнитьЗначенияСвойств(СтруктураУчастника,НовыйЭлементОрг);
			 УчастникНайден = 1;
		КонецЕсли;
	КонецЦикла;
	
	Дерево = РеквизитФормыВЗначение("ДеревоНастроек");
	Дерево.Строки.Сортировать("ПредставлениеОрганизации",Истина);
	ЗначениеВРеквизитФормы(Дерево,"ДеревоНастроек");
	
	Если ЕстьОшибка И СообщатьОбОшибке Тогда
		
		ТекстОшибки = НСтр("ru='Внимание!
		|В списке участников присутствуют организации, указанные как ГАН для других участников,
		|но для них самих в настройке выбран другой участник-ГАН.
		|Организации, передающие данные подведомственных в сервис, не могут сами считаться подведомственными.	
		|Необходимо исправить настройки таких организаций (выделены красным)!'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
	КонецЕсли;
	
	Если УчастникНайден>0 Тогда
		ТекЗапись = РеквизитФормыВЗначение("ТекущаяЗапись");
	
		ТекЗапись.Организация = СтруктураУчастника.Организация;
		ТекЗапись.Подведомственный = СтруктураУчастника.Подведомственный;
		ТекЗапись.Прочитать();
		ОрганизацияКонтрагент = УчастникПоУмолчанию;
		
		Если ЗначениеЗаполнено(СтруктураУчастника.Подведомственный) Тогда
			ОрганизацияГАН = СтруктураУчастника.Организация;
			ГАНВДругойБазе = Ложь;
		ИначеЕсли ТекЗапись.РежимВзаимодействия = "Косвенное" Тогда
			ГАНВДругойБазе = Истина;		
		КонецЕсли;
		
		Элементы.ОрганизацияГАН.Доступность = НЕ ГАНВДругойБазе;
		
		ЗначениеВРеквизитФормы(ТекЗапись,"ТекущаяЗапись");
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,"ТекущаяЗаписьПолномочияУчастникаПосредника","ТолькоПросмотр",НЕ ТекущаяЗапись.ЭтоУчастникПосредник);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,"ТекущаяЗаписьПолномочияУчастникаПосредникаНачисления","ТолькоПросмотр",НЕ ТекущаяЗапись.ЭтоУчастникПосредник);

		ЗаполнитьЭлементыФормыПаролейЭП();
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииРежимаВзаимодействия()
	Элементы.ТекущаяЗаписьСертификатЭПНачислений.АвтоОтметкаНезаполненного = Ложь;
	Элементы.ТекущаяЗаписьСертификатЭПСообщения.АвтоОтметкаНезаполненного = Ложь;
	Элементы.ТекущаяЗаписьСертификатЭПСообщения.Доступность = Истина;
	Элементы.ТекущаяЗаписьСертификатЭПНачислений.Доступность = Истина;
	Элементы.ДанныеИСУчастника.Доступность = Истина;
	
	Элементы.ГруппаКосвенноеВзаимодействие.Доступность = Истина;
	
	Если ТекущаяЗапись.РежимВзаимодействия = "Прямое" Тогда
		// Если взаимодействие в рамках данной организации выполняется напрямую,
		// то для упрощения процесса подписывать будем когда формировать файлы
		// при непосредственном обмене.
		
		Элементы.ТекущаяЗаписьСертификатЭПНачислений.АвтоОтметкаНезаполненного = Истина;
		Элементы.ТекущаяЗаписьСертификатЭПСообщения.АвтоОтметкаНезаполненного = Истина;
		Элементы.ГруппаКосвенноеВзаимодействие.Доступность = Ложь;
		
	ИначеЕсли ТекущаяЗапись.РежимВзаимодействия = "Косвенное" Тогда
		
		Если ТекущаяЗапись.РежимПодписи = "Самостоятельно" И ТипЗнч(ОрганизацияКонтрагент) = Тип("СправочникСсылка.Контрагенты")Тогда
			//Подписывает АН сам, в своей базе.
			//Отключим элемент с сертификатом для подписи сущностей.
			Элементы.ТекущаяЗаписьСертификатЭПНачислений.Доступность = Ложь;
		ИначеЕсли ТипЗнч(ОрганизацияКонтрагент) = Тип("СправочникСсылка.Организации") Тогда
			//Подписывает АН сам, в этой базе.
			//Следует обязательно заполнить сертификат.
			Элементы.ТекущаяЗаписьСертификатЭПНачислений.АвтоОтметкаНезаполненного = Истина;
		КонецЕсли;
		//При косвенном взаимодействии подпись заголовка сообщения выполняет ГАН, 
		//данный сертификат должен быть указан для участника - ГАНа.
		//
		Элементы.ТекущаяЗаписьСертификатЭПСообщения.Доступность = Ложь;
		Элементы.ДанныеИСУчастника.Доступность = Ложь;
		ТекущаяЗапись.ИмяИСУчастника = "";
		ТекущаяЗапись.КодИСУчастника = "";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииУчастника()
	
	Элементы.ГАНВДругойБазе.Доступность = Истина;
	Элементы.ШаблонУИН.АвтоОтметкаНезаполненного = Ложь;
	Элементы.ШаблонУИН.Доступность = Истина;
	
	//Если выбираем участника - контрагента, то значит мы находимся в базе ГАНа, которая выполняет обмен с сервисом.
	//Для контрагента необходимо указать организацию - ГАН
	Если ТипЗнч(ОрганизацияКонтрагент) = Тип("СправочникСсылка.Контрагенты") Тогда
		ГАНВДругойБазе = Ложь;
		Элементы.ГАНВДругойБазе.Доступность = Ложь;
		Элементы.ОрганизацияГАН.АвтоОтметкаНезаполненного = Истина;
		Элементы.ШаблонУИН.Доступность = Ложь;
	ИначеЕсли ТипЗнч(ОрганизацияКонтрагент) = Тип("СправочникСсылка.Организации") Тогда
		// Если участник - это ссылка на справочник Организации, то нужно указать шаблон УИН
		Элементы.ШаблонУИН.АвтоОтметкаНезаполненного = Истина;
	КонецЕсли;
	
	ОпределитьВидимостьПолейНастроек();
	
КонецПроцедуры

&НаСервере
Процедура ВыбратьНаСервере(ИдентификаторСтр)
	
	ТекСтрока = ДеревоНастроек.НайтиПоИдентификатору(ИдентификаторСтр);
	ТекЗапись = РеквизитФормыВЗначение("ТекущаяЗапись");
	
	ТекЗапись.Организация = ТекСтрока.Организация;
	ТекЗапись.Подведомственный = ТекСтрока.Подведомственный;
	ТекЗапись.Прочитать();
	
	Если НЕ ЗначениеЗаполнено(ТекЗапись.РежимВзаимодействия) Тогда
		//установим значение по умолчанию для новых участников
		ТекЗапись.РежимВзаимодействия = "Прямое";
	КонецЕсли;

	ОрганизацияКонтрагент = ?(ЗначениеЗаполнено(ТекСтрока.Подведомственный),ТекСтрока.Подведомственный,ТекСтрока.Организация);
	
	ШаблонУИН = "";
	ШаблонУИН = Справочники.ШаблоныИдентификаторовКвитанцийНаОплатуГосуслуг.ПолучитьШаблонУИНКвитанции(ОрганизацияКонтрагент);
	
	ОрганизацияГАН = "";
	
	Если ЗначениеЗаполнено(ТекСтрока.Подведомственный) Тогда
		ОрганизацияГАН = ТекСтрока.Организация;
		ГАНВДругойБазе = Ложь;
	ИначеЕсли ТекЗапись.РежимВзаимодействия = "Косвенное" Тогда
		ОрганизацияГАН = "";
		ГАНВДругойБазе = Истина;
	КонецЕсли;
	
	Элементы.ОрганизацияГАН.Доступность = НЕ ГАНВДругойБазе;
	
	ЗначениеВРеквизитФормы(ТекЗапись,"ТекущаяЗапись");
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,"ТекущаяЗаписьПолномочияУчастникаПосредника","ТолькоПросмотр",НЕ ТекущаяЗапись.ЭтоУчастникПосредник);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,"ТекущаяЗаписьПолномочияУчастникаПосредникаНачисления","ТолькоПросмотр",НЕ ТекущаяЗапись.ЭтоУчастникПосредник);

	ЗаполнитьЭлементыФормыПаролейЭП();
	
	ЭтаФорма.Модифицированность = Ложь;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЭлементыФормыПаролейЭП()
	
	УстановитьПривилегированныйРежим(Истина);
	СтруктураПаролей = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(ОрганизацияКонтрагент,"ПарольЭПНачислений,ПарольЭПСообщения");
	УстановитьПривилегированныйРежим(Ложь);
	
	ПарольЭПНачислений = "";
	ПарольЭПСообщения = "";
	ПарольЭПНачисленийИзменен = Ложь;
	ПарольЭПСообщенияИзменен = Ложь;
	Если ЗначениеЗаполнено(СтруктураПаролей.ПарольЭПНачислений) Тогда
		ПарольЭПНачислений = ОрганизацияКонтрагент.УникальныйИдентификатор();
	КонецЕсли;
	Если ЗначениеЗаполнено(СтруктураПаролей.ПарольЭПСообщения) Тогда
		ПарольЭПСообщения = ОрганизацияКонтрагент.УникальныйИдентификатор();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УдалитьЗаписьНаСервере(ИдентификаторСтр)
	ТекСтрока = ДеревоНастроек.НайтиПоИдентификатору(ИдентификаторСтр);
	ТекЗапись = РегистрыСведений.НастройкаОрганизацийДляГИСГМП_УНП.СоздатьМенеджерЗаписи();
	
	ТекЗапись.Организация = ТекСтрока.Организация;
	ТекЗапись.Подведомственный = ТекСтрока.Подведомственный;
	ТекЗапись.Прочитать();
	Если ТекЗапись.Выбран() Тогда
		ОрганизацияКонтрагент = ?(ЗначениеЗаполнено(ТекСтрока.Подведомственный),ТекСтрока.Подведомственный,ТекСтрока.Организация);
		УстановитьПривилегированныйРежим(Истина);
		ОбщегоНазначения.УдалитьДанныеИзБезопасногоХранилища(ОрганизацияКонтрагент,"ПарольЭПНачислений,ПарольЭПСообщения");
		УстановитьПривилегированныйРежим(Ложь);
		
		ТекЗапись.Удалить();
	КонецЕсли;
	ОбновитьДеревоСтруктурыПодведомственных(Истина);	
КонецПроцедуры

&НаКлиенте
Процедура ПарольЭПНачисленийПриИзменении(Элемент)
	ПарольЭПНачисленийИзменен = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПарольЭПСообщенияПриИзменении(Элемент)
	ПарольЭПСообщенияИзменен = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияГАНПриИзменении(Элемент)
	Если ЗначениеЗаполнено(ОрганизацияГАН) Тогда
		ТекущаяЗапись.УРНГАН = "";
		ТекущаяЗапись.ПолномочияУчастникаГАН = "";
	КонецЕсли;
	Элементы.ГруппаНастройкиУчастникаПрямогоВзаимодействия.ТолькоПросмотр = ЗначениеЗаполнено(ОрганизацияГАН);
КонецПроцедуры





#КонецОбласти
